{"Job_Title":{"0":"Embedded Systems Software\/Hardware Engineer","1":"Hadoop Protection Execution Onshore Lead - 4637278","2":"Laser Programmer, Quality Assurance Manager, Sales and Marketing Manager","3":"Sr. Software Engineer - GNSS\/Positioning","4":"Software Engineer","5":"Software Developer - Digital","6":"Principal, Software Engineering: Java","7":"Software Developer I","8":"Staff Software Engineer, Personalization","9":"Senior Software Engineer","10":"Software Developer - Digital","11":"Software Engineer I","12":"Senior Software Engineer, Full Stack (Remote - Eligible)","13":"Software Developer","14":"Software Developer, Junior"},"Company":{"0":"MZA Associates Corporation","1":"Accenture","2":"Cupples J&J Company Inc.","3":"Garmin International, Inc.","4":"CHG Management, Inc.","5":"Costco Wholesale","6":"Options Clearing Corporation","7":"Noridian Healthcare Solutions","8":"Discord","9":"Capital One","10":"Costco Wholesale","11":"Onyx Aerospace, Inc.","12":"Capital One","13":"Fullsteam","14":"Booz Allen Hamilton"},"Link":{"0":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0CRngAmoPL2H9QAzS6rn60lIN6cVZ6KIMsGL_FMmvAzbtisVxSnzo6-qpd373R3hgNjmg70tcAjfMVG9FxaU86QEM1xwNn6z24TgFzv0ngrBXQ9int0wh7seuw1uCjfaOvPP1_m_t01_cPCP945QSeBChfr0HAIFt8m0WmCGd-dXBVUu-nTkPTIehLPrLPFp5lchBhOBt4mtcbS9E0AgMAZgKFYexh3yaxYsRnov8zLhf-E-F_LlVGSuam-COozD0X_5SAZ3voyBDC6YdWflffRT3bUJEoXgQZ55oMYa2qzUgTi6szQfz96ExV7uf8H2MKS0dM5obosHXfdV00nQ6PDH4rkpzIkofXI-pDktLH9PKbMeqThGXdl4PLrSaRmjeA_XgBslkDPeWZ-cpr2p06Ls0B66ANUo7Z4OgPNswZiAAh5oHvDHAVB388MUBnFswoYYO0PDuiF9ya8ZGZB5a1nSTomhqSWDo45e_HEbiHQXxhbSQR_J9IoKMtY5YQw8ZB8DQVXbChO6moFqj1u8QMoLJyEpktBeh7BIGP3TJhow99jxXKs23Wao4YBODgsMmA=&xkcb=SoCw-_M3T-IRGjxJtZ0KbzkdCdPP&p=0&fvj=1&vjs=3","1":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0APE6fJhDGMuC5jbJTJUCIacRGCS_mnoKGgY-k6jMj3Ot88NCDyhNvnVknVQlzVW585DC79NtF7dK9ew3H8Y91uhYFx11SG8fEXlUQRx2lbUw05nFeqieWE1Bjom2jSDrV5-0XPkPBW_wN1a2UEwfeHXdE2TfTc-f1z9q6FxhwdU89Lwv1d6C9uuer2QBwCadCFwCTPNNfFVYd9kTN4IVf6LIHEBBtYKCDsbgAzF-fBiBXeGGDQpr9RZjq7KeDlLWpNyFVGV1E-HyV3JD_flV3y-JPlIhiDimNLPCg2dR-HGErVxZQF2bExeSaqTz890Foko98oiU3-1Q9pKEgkKmojH1kiCABiMWn76Zef5pFP2vu-w_r9ja6ctIggxljGeu3JcVEzTpkcYnsCm4LM7uRk1564_nXmft7QZRzjvL0kNya42jeri7nbh2qiJByLoZwdo_XnvytdYPF74jXkYeDF9x-Bsh3VDOuxQ8VtSxMoqCV2f2r8RoUzQe9gsjHXmjk6Qk48nmHcTxJkNlfHzvQfYCeVYjxRsIiGY2n7DRB6iO2Rkz0ATqEY4y629Z8ycRTAzsgcCOF_gA225AWhKhhzN2uQQvI9j5k=&xkcb=SoAX-_M3T-IRGjxJtZ0PbzkdCdPP&p=1&fvj=0&vjs=3","2":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0DXCiiqPCNREQifXu1g7zxnWPwvLyAh3ZrQLs5ZJ76sgEBkFHzyFXxslwrh3596MOu9WXd1dSnVgM1m7v_TiUSSOiSdCqBv9_jSyEsiZyotUD9Y-e6TnV7Qql_G3gTmcFShAv_Yn8I7cRrOxsTd09I-H1gpxHEAAiKSO6Ejzth7gVIUxNoTZLoaKhJv6ZU5-DUzd9gsUj9WhgHSeUYlXpF021L9gZKoe607UZBDGaZjx-Av03Z64lrOTNY3sZJoZhTEjD0Bu84IYVrIVtAOoHKiqG_pZoiWODhv__tfoa2hEYMt4UV_2ilIH4J-JrAbvbzp84a9MJ0F7bKzumdy6ItRdA4lj_Elb8H8UwhTwfbpo3mS9-G9ANzsMLI8QgQ4FkTQghCQbypLKJl-c_OPwN96PnIwxRLkbJ-eyut9EPD9aXPZGLCBwGbCkSmvJbCEyp1xa7L-ep8QYEn9dLpfO0BelXQVoMvqXlzEaFeBaksBFDSv_cGHl8EqIqR5l4NVxOLT77lbDU0vs6ffjdiWTnOD30qmo5NrfcDee5_fhCiHzY6MXHd7vy__CTWi2-QsVCLhl05HOjHW9JcZc53MJOrOj1Fqan3WUyQvzdjY_XdfLQ==&xkcb=SoCK-_M3T-IRGjxJtZ0MbzkdCdPP&p=2&fvj=1&vjs=3","3":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0Dg5evNRJvCPk13WGyVOuD3l37uSO45pL6JOyYp8f8uecwN0Gw3k07C6B5H3O0ZUk665lkU2OVmR0U_m0gLGm15njCADdvFovDzdt33RegmPmcucxf6yahKCpQ1TX2ZYYYJ7cIwq1v77tTF2YBq9i9WO-_7O6L9sc6BgDG_h2y_drUmeR9IdOKitbXKNImrr74hmvsZSyAxIPigC4jCngXmSpN171KyqeEWo8ml4VGCxkaX1iDY-z6oQQKVIlb1iG7QMnv_oVek7h1j_2LiJ9ZsbG9xycIQQXQyH9p1beSHrJlwmrgceCyAVC7e0Zsp11XJiBV10LDR3ZVzf7z6z477WTZJCT8hsd4YL8HCJZ3c0lO9jGEqCMvvPAL__GY617Ggn9oKkMft12saLLn9IfUm1Ji3miR_bdjgX9PkLjrdKdWUHW6WwcR3IdNhppmwTnNHfJ5nDze5rtNT8h2PSUZ725v7yUDwGNfDISxK8Inb1WcakWZOjlDPYuhes5TjHOYGexCBAI0KDY1j_7P4qISGkwyQIZvsqu6lmHyOtmxrrTntGac5ioMz40F6O3YRz9HFLGVoTp2rrrERCTtmexNuSZNEq7YAF9yXnDJMr3vAQ46vm_JXKU48EpF-lA0sJr6z_ZZXC35ocjM0v_CEv1EDbJXp-RJVtQHL8mlfHJdodwDMmgrZ2Bod2IJrtAFSREUOh0rohAerszmpIp7qafQ6f5ZXwsm9_1cHrV6B2wN3zZ7X4ZYi7E8mI56B3WntXUdv-lTQT6_v6z66oDVYz7djYak7NNeCs4RpdeJdUSjU8g==&xkcb=SoA--_M3T-IRGiRJtZ0KbzkdCdPP&p=3&fvj=0&vjs=3","4":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0CceMWquIf6nnfDkMSQDr-VTcXdNFm4hBrKQZQGSbVz7rugr4XaLQi0hx3eyn1M-K8XRZLy8dSE4xQxkmn2eqLfHuTSiLOdnzx5BaC7rnomz2xCDPhxpBlfcMeP-k6ncpf0_HvIAp5PEtjvsmeWSKxRuVL3R0rnnQmPpWWxLXtESApQ_lIikH9EN2w63mDj4wUQC24ffpKjFWZ71iAY3bFx1G60cqUQv9dhaEWwYNqM_xwiO4HiqDESDPv3Z6myJfwx2lg6np6V_j_rmVeuI-3VqWaDsGl4pwGMKELyXWbtHWgXt9nlOon07mxdGTo2zJSwvbswwJ7LCdUlgsSOdPKgEeyRdokIdO88UMaA0krhc433M6W1mZGB1q96wC6CCKujY02u443uMe7y1guA4yO8HGRck9o4QA3g-AIQ-d2CIVyWG2-xqVP1-BOpJ2oqDUg7QSfWsYeStZQX_VnOEu4dYC2z4ft4eHTip757m7OReiExU9GT5u8u-0uGw95PBVyZhMpbPVA4niryw7DfSyMBP2P6ycqbIJzO3eEV2D-43HfWhoMgOVDZCgwSGelSmR1PLRC8HvhCQTkep4GgSH0PXXlzfjAtWEFMCZ48T6e-rYF2dzbuN4Wk6pQBWehpH739yuJK1Fuu4GNrZDOreE48VV2oEqpCkHkNdyc4edcqF7uYcaSPsQHDYt6cFccBBvuQMElZ83uazpUIdj04vb1PafmUDr5-wJVrnJQ8LcZIDxqo4Cf-Zykt8BQJ4xz47mQcWNMPojGPph4BIi4z5-Br_QYL5gTEpIl5ExyAQRA3plr2Tgsv8ypZGujNRJLtqdPPVTRn8R6LbYxaSEXtrrO1beie8QzFYj0=&xkcb=SoCZ-_M3T-IRGiRJtZ0PbzkdCdPP&p=4&fvj=0&vjs=3","5":"\/rc\/clk?jk=9a6ede25a79e09df&fccid=9b77e2b0ccfb3838&vjs=3","6":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0DHTfY2R4CHA1M8nnimMZ5tgIxVB9jIrd-jfrUmz0n1tYErFHFlQVjz5yC5_5zxZ6QKnqFBkQ6TiiSRSwsGPzWO2Heh2ZLaWEccR5J0lNzLnt1-srWJWqrOGyxN5iPHKCc_i5tCJv4ZcNkWzaQbjVS_gy9xIAvZ2QEpB_6larba5eGzQ1KfLjTFwlcWqOlaxPzBbctNjIC1_h9I7MEAUirxpmzYlO8bAnYSIOeNpgN1zCako7Hsh2b6RrFrZKwxsdHYrcsvsIPJKUkzgOrbiM-vGEjiPnmvJjQiBGj_OnN3MreSSenfPD_YhsYNkrFCmgjDiqFgbS0YRGZe0PN0bbDWqsNg-m-wX1E-8ze3s4HVgnbiYIyvA7owx6M19Oh16TuUotZw0ae_pUd7Ga9s7Ax72vJzxKi486NEwmoYjr8Tjo5t3yayxcD6cSVLpyqZDE__TlEbBZYpRktu07FEmcf6T1M_wye1HH7kYgi5Al4i6zaf_DLPs8mtKbhe_sw8vMChHJ0hGhVOgAR3VMyqa8xqCRww9sr59PS6XvVqJw7Gfm-3nV-MfWhrRHecpFAUFL_cAwOW_6Mfe3CGM9-AYZ3GHJvuNbd7zc5uXIvfsWzZy5wkZFH2ovPh_fgZaQcJcGM=&xkcb=SoBZ-_M3T-IRGiRJtZ0CbzkdCdPP&p=6&fvj=0&vjs=3","7":"\/rc\/clk?jk=727e969bee675095&fccid=5e8b35d941c85c49&vjs=3","8":"\/rc\/clk?jk=b5a31b410a037fcb&fccid=f2ab4689def17626&vjs=3","9":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNb9EbKZEg8x0tL4Jn_n-27WN9beXv9--y3k_QfBV6RMZRB7jI6Qkswh2WuP-3TnzqfyYQXX3hhKgzQO1kQPwB5wvIte2MYqjBtlsLa3lb2cZ0oA1Ni1WjMsjK7G6XCXtWyRwb0oX5_eYKUI-wUsQh3kL4eGYDi-r53KqacaIJRjKdz5ujvp24ilG81E-8n9-7DguvlQE_AvxL9icXvwyQ7LcRwhTZGzVpW4Q0UQK-zrdtDVE29yUM1wbR0LoGABjkSidMtzCQsUlwXnGdFJhrR7zpDJhPVuoJom2pbXaie0wf2in7DUy0X7pv5QcOU2aurORyK1jUBRfonZs8phuuStGzTwx6DLf0P_YlFhJOsfW8iFKPBLVQkFxblNNbMpw1DeZEb79QuvnqaIE9TZZkouDtj2iWOkJfRAnxzs5A-_YGB-gYspwO5k=&xkcb=SoBo-_M3T-IRGixJtZ0ObzkdCdPP&p=9&fvj=0&vjs=3","10":"\/rc\/clk?jk=7ce4e108cfbe3f73&fccid=9b77e2b0ccfb3838&vjs=3","11":"\/rc\/clk?jk=83da51deedb0c9f7&fccid=81e4f51d7f86d848&vjs=3","12":"\/pagead\/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNb9EbKZEg8x0tL4Jn_n-27WN9beXv9--y4BhKygcp1GJstETtevVSGZYo_xLXTja9pe0bOcCfwgT7kSysRed_pNByeypb77McnfWS4SWXRWCs1QZAzdL9qswjXyK_JU14eGbqAXGAk-f6SLj2eq-IyX8x2PPRaJxhRCf9RjqTBrGUU0cWUYzZjIjDxAjO5L2OsW3oarWM450Syl6knfGDEOkyYVxL8qNHJiAPnIjAMKUKK1VBO1sccNlr6HYJJi0IH2ubtQo3JB-HTfOLsHHnCYJhYBru0KxW4MGBhTHjirJ20I3j0UiMwGnYCue0DhOByeHOp7uKCptfaDwE05vgyUaBpAeYYljEplM1bfJMyUMvJq09sULqy9jZzXHkdSeYEX_kMAMfaJZ3AuJY7Gegov4gZdrCxKrBS-ah_FZ2Kssc3iXYmwmkE8=&xkcb=SoBS-_M3T-IRGtRJtZ0KbzkdCdPP&p=12&fvj=0&vjs=3","13":"\/rc\/clk?jk=457858cda6d73e87&fccid=380a971a7c919e3e&vjs=3","14":"\/rc\/clk?jk=b8f6807751984821&fccid=4e041af1d0af1bc8&vjs=3"},"Description":{"0":"Job description:Develop hardware and software systems for real-time optical acquisition, tracking, and beam control systems. Participate in a development team making contributions to the hardware and software design and implementation of systems that employ state-of-the-art high-speed real-time hardware and software processing.\nQualifications:Minimum: BS or MS in computer, software, or electrical engineering field or equivalent experience. Strong software and\/or hardware engineering background. Desired: Experience with real-time embedded systems working with optical sensors and control equipment. Experience with beam control, acquisition, tracking, and pointing hardware and software. Experience with real-time operating systems, FPGA, and GPU programming. Experience with National Instruments, Zedboard, and Xilinx FPGA equipment.\nCompensation will be commensurate with education and experience. MZA offers a full complement of fringe benefits including health, life, and disability insurance, an excellent retirement plan, educational subsidies, and paid vacation and holidays.\nMZA is an equal opportunity employer. Because we work on national security projects, most candidates will need to be able to obtain government security clearances and therefore must be US Citizens.\nJob Type: Full-time\nJob Type: Full-time\nSchedule:\n\nMonday to Friday\n\nAbility to commute\/relocate:\n\nAlbuquerque, NM 87109: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\nAre you able to obtain a security clearance?\n\nExperience:\n\nEmbedded software: 1 year (Preferred)\n\nWork Location: One locationHealth insurance","1":"\nAccenture Flex offers you the flexibility of local fixed-duration project-based work powered by Accenture, a leading global professional services company. Accenture is consistently recognized on FORTUNE's 100 Best Companies to Work For and Diversity Inc's Top 50 Companies For Diversity lists.\n\n As an Accenture Flex employee, you will apply your skills and experience to help drive business transformation for leading organizations and communities. In addition to delivering innovative solutions for Accenture's clients, you will work with a highly skilled, diverse network of people across Accenture businesses who are using the latest emerging technologies to address today's biggest business challenges.\n\n You will receive competitive rewards and access to benefits programs and world-class learning resources. Accenture Flex employees work in their local metro area onsite at the project, significantly reducing and\/or eliminating the demands to travel.\n\n Hybrid work model (remote and onsite work locations: Charlotte, NC, Dallas, TX or Hopewell, NJ)\n\n We are looking for a candidate who is well versed in business system analysis and design. The team member will act as a liaison between application teams, governance and audit for all required processes and documentation to address product vulnerabilities. They will be responsible for ensuring the efficiency of business operations. They will closely work with application teams to provide assistance, resolve questions and recommend action items required to stratify deliverables. They will be reporting on a daily basis Key Performance Indicators KPI to help drive the success of projects.\n\n #OT-IDX\n\n\n\nBasic Qualifications:\n\n Associates Degree\n Minimum 3 years of Agile Project Management\n Minimum 3 years of Software Engineering experience\n Minimum 5 years of business systems analysis or business systems design experience\n Familiarity with dataflow structure within a complex environment\n Excellent verbal, written, interpersonal and communication skills\n Excellent organizational and leadership skills\n Advanced Microsoft Office Outlook, Excel, Word, PowerPoint, LiveMeeting and SharePoint skills\n Strong Analytical skills with high attention to details and accuracy\n Ability to work in a fast-paced deadline driven environment\n\n\n Preferred Qualifications:\n\n Outstanding problem solving and decision-making\n Ability to work effectively in a team environment and across all organization levels\n Strong demonstration and facilitation skills\n Experience with Agile project methodologies\n\n\n Compensation for roles at Accenture varies depending on a wide array of factors including but not limited to the specific office location, role, skill set, and level of experience. As required by local law, Accenture provides a reasonable hourly range of compensation for roles that may be hired in California, Colorado, New York City, or Washington as set forth below and information on benefits is here.\n\n Role Location: Calculated Hourly Range for role\n California: $57.69 - $67.69 per hour\n Colorado: $57.69 - $67.69 per hour\n New York City: $57.69 - $67.69 per hour\n Washington: $57.69 - $67.69 per hour\n\n #FLX123\n\n What We Believe\n We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n Equal Employment Opportunity Statement\n Accenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n Accenture is committed to providing veteran employment opportunities to our service men and women.\n For details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n Requesting An Accommodation\n Accenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n If you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n Other Employment Statements\n Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n","2":"Cupples J&J Company Inc. has various needs for Machining and Fabrication Technicians and other Supporting Positions as follows for its Dyersburg, TN and Jackson, TN Divisions;\nElectrical Engineer\nHuman Resource Manager\nCNC Machinists - Job Shop and Production\nVertical Machining Center - Program \/ Setup Operate\nCNC Lathe - Program \/ Setup \/ Operate\nVTL - Program Setup Operate\nConventional Job Shop Machinists\nManufacturing Engineer\nLaser Cutting Technicians - CO2 and Fiber Lasers\nWater Jet Technician\nCNC Brake Press Program \/ Setup \/ Operators\nCNC Punch (Trumpf) - Setup \/ Operators\nRobot Welder - Program \/ Setup \/ Operate\nRobot Programmer - Programming of Pick and Place and Machine Tending as well as Robot Weld Programming\nFour Roll CNC Roll - Program \/ Setup \/ Operate\nMachine &Tool Designer (Solid Works or Inventor)\nProduction Fabrication Estimator \/ Project Manager\nComputer Network Technician \/ Computer Science with Management Information Systems\nQuality Assurance Technicians \/ CMM Tech\nOffice Assistant - Front Desk, Job Cost, Accounts Payable, Accounts Receivable\nAll positions must be able to read and interpret standard drawings as well as industry and customer specifications.\nCupples is a rapidly growing Machining and Fabrication Operation in Jackson, Tn with a second operation in Dyersburg, Tn. We employ approximately 280 employees and have a wide range of equipment and capabilities.\nPlease see our website at http:\/\/www.cupplesjandj.com for more on our facilities and capabilities.\nCupples J&J Company is a debt free company!''Work Location:\n\nMultiple locations\n\nPay Frequency:\n\nWeekly\n\nWork Remotely\n\nNo\n\nJob Type: Full-time\nPay: $18.00 - $50.00 per hour\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nRelocation assistance\nRetirement plan\nTuition reimbursement\nVision insurance\n\nExperience level:\n\n2 years\n\nShift:\n\n10 hour shift\n8 hour shift\nDay shift\nNight shift\n\nWeekly day range:\n\nMonday to Friday\nWeekend availability\n\nWork Location: Multiple LocationsHealth insurance","3":"\n Overview: \n \n   We are seeking a full-time \n  Sr. Software Engineer - GNSS\/Positioning to join our growing team of GNSS and positioning experts in Garmin’s Core Platform Technology organization! In this role, you will be responsible for developing superior GNSS-based positioning solutions for all consumer markets that Garmin serves. We have openings in multiple Locations (preferably Olathe, KS but also available in Boulder, CO or Cochrane, Alberta Canada).\n  Responsibilities: \n \n Essential Functions\n\n\n Contribute to advanced technical research and development in positioning technologies\n Design, implement, test and document complex software applications using C\/C++ for use in embedded systems\n Participate in peer reviews of software designs, algorithm designs and software implementation\n Collaborate with colleagues on software\/algorithm design approaches and implementations\n Provide reliable solutions to a variety of positioning problems using sound problem solving techniques\n Qualifications: \n \n Basic Qualifications\n\n\n Master’s Degree in Computer Science, Geomatics, Electrical Engineering or related engineering\/technical field AND a minimum of 3 years experience OR Bachelor’s Degree in any of the fields noted above AND a minimum of 5 years experience OR an equivalent combination of education and experience\n 3+ years of experience in GNSS positioning engine development: understanding of GNSS measurements and error sources, estimation techniques including least squares & Kalman filtering, blunder\/fault detection, multi-constellation and multi-frequency, GNSS Augmentations\n Experience developing software in C\/C++ for embedded, real-time environments\n Ability to use scripting languages to automate analysis (ex. MATLAB, python, etc.)\n Competence in researching problems and implementing appropriate algorithmic solutions\n Demonstrated strong and effective verbal, written, and interpersonal communication skills and is a strong team player\n Must be positive, detail oriented, organized, team oriented and a driven problem solver, multi-tasker, and self-starter with the ability to prioritize and lead in a fast paced, deadline-driven environment\n\n\n Desired Qualifications\n\n\n Experience in inertial navigation techniques (ex. vehicle and pedestrian dead reckoning, GNSS aided INS)\n Experience with carrier phase positioning techniques (RTK\/PPP)\n\n\n\n Garmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.\n\n","4":"\nHealthcare’s helping hand.\n CHG shook things up in 1979 by inventing the locum tenens staffing model. We connect doctors with patients who need their care. As the largest physician staffing firm in America, our providers treat millions of patients each year.\n Our industry is growing and demand is high. This means you’ll have plenty of opportunities to grow and develop in your career. Keeping healthcare healthy can be as fun as it is rewarding.\n Be a key part of an amazing team building cutting edge, customer-facing applications and features for our physician portal. As a Software Engineer you’ll develop high-quality software using solid architecture design and engineering best-practices for the software engineering organization. You’ll have a dedicated leader focused on your individual growth and development and will work on a collaborative engineering team with opportunities to share mentoring and coaching.\n\n Our primary programming language is JavaScript. We are looking for highly motivated individuals who can own development and testing for their teams and thrive in a highly collaborative environment.\n\n Responsibilities\n\n Proficiency in JavaScript\n Proficiency in one or more modern application frameworks (Node.js, Vue.js, React)\n Experience with cloud technologies\n Experience designing and building microservices and RESTful APIs\n Experience with DevOps and CI\/CD\n Passionate about automated testing and quality assurance\n\n\n Qualifications\n\n Able to work independently on assigned tasks within a collaborative team-oriented environment using sound judgment in decision making\n Excellent communications skills, both verbal and written, including good technical writing and interpersonal skills\n Excellent ability to mentor others\n\n\n Education\n\n 3+ years of professional experience as a software engineer\n BS or MS in Computer Science or related technical discipline preferred\n\n In return we offer:\n\n 401(k) retirement plan with company match\n Traditional healthcare benefits such as medical and dental coverage, and some unique benefits like onsite health centers, corporate wellness programs, and free behavioral health appointments.\n Flexible work schedules - including work-from-home options available\n Recognition programs with rewards including trips, cash, and paid time off\n Family-friendly benefits including paid parental leave, fertility coverage, adoption assistance, and marriage counseling\n Tailored training resources including free LinkedIn learning courses\n Volunteer time off and employee-driven matching grants\n Tuition reimbursement programs\n\n Click here to learn more about our company and culture.\n We are an Affirmative Action\/Equal Opportunity Employer Veterans\/Disabled We are an at-will employer\n What makes CHG Different? You.\nHealth insurance","5":"\n\nCostco IT is responsible for the technical future of Costco Wholesale, the third largest retailer in the world with wholesale operations in fourteen countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco ranks seventh in Forbes “World’s Best Employers”.\n This is an environment unlike anything in the high-tech world and the secret of Costco’s success is its culture. The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes. Our employees and our members come FIRST. Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others. \nCome join Costco Digital - part of the Costco Wholesale IT family. Costco Digital is a dynamic, fast-paced environment, working through exciting transformation efforts. We are building the next generation digital retail environment where you will be surrounded by dedicated and highly professional employees. We are embarking on a large digital transformation and need team members like you to help us grow to the next level.\n Our Digital team is transforming how we deliver solutions and interact with our members across our Mobile, Commerce and Order Management platforms. We have a culture of improvement & learning with a start up mentality and a customer centric approach for our Costco members and our employees. We are looking for talented individuals to join our team and pursue bold ideas and explore growth opportunities. \nWe are looking for talented individuals to join our team in 2023. As a graduate, you will get opportunities to kickstart your career, pursue bold ideas and explore growth opportunities.\n\nResponsibilities:\n This role provides candidates with the opportunity to join one of our engineering teams where you will have the opportunity to:\n\nDevelop efficient, highly scalable and secured services to build\/integrate Commerce, Mobile and Order Management solutions \nOptimize backend systems and services for security, modularity, efficiency and scalability. \nDevelop best-in-class front end experiences utilizing React. \nDevelop Mobile applications on iOS and Android. We encourage all of our mobile developers to be open to exploring both platforms. This role is ideal for developers who feel confident in their technical ability and want to be a part of a highly-skilled and constantly improving engineering team. \n\nQualifications: \n\nBachelor's or Master's degree in Computer Science or related technical discipline. \nFinal year or recent graduate with a background in Software Development, Computer Science, Computer Engineering, or a related technical discipline. \nExperience with coding in Java, C# or JavaScript, Swift, Kotlin. \nAwareness of common coding frameworks like Flutter. \nSoftware programming capabilities that exhibit good code design and coding style. \nGeneral understanding of data structures, networking, data security and highly scalable systems design. \nGeneral knowledge of common databases and messaging frameworks like Cosmos, MySQL, Redis, Kafka.  \n\n\nPreferred Qualifications:\n\nDemonstrated software engineering experience from previous internship, work experience, coding competitions, or publications. \nHigh levels of creativity and quick problem-solving capabilities. \n\nRequired Documents \n Cover Letter\n Resume \n\nCalifornia applicants, please click here to review the Costco Applicant Privacy Notice.\n\n \nPay Range: $85,000 - $110,000\n We offer a comprehensive package of benefits including paid time off, health benefits — medical\/dental\/vision\/hearing aid\/pharmacy\/behavioral health\/employee assistance, health care reimbursement account, dependent care assistance plan, commuter benefits, short-term disability and long-term disability insurance, AD&D insurance, life insurance, 401(k), stock purchase plan, SmartDollar financial wellness program, to eligible employees.\n Costco is committed to a diverse and inclusive workplace. Costco is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or any other legally protected status. If you need assistance and\/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to IT-Recruiting@costco.com\n If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas.\n\n\nHealth insurance","6":"\n\n  What You’ll Do\n \n\n   This role will be part of a world class software development team on OCC's next generation clearing, settlement, and portfolio management system. In this role, you will create solutions to complex technical challenges while coding, testing, troubleshooting, debugging, and documenting the systems you develop.\n \n\n Responsibilities\n \n\n Provide expert knowledge building OCC’s next generation clearing, settlement, and portfolio management system, and paving the future of digital transformation in the capital markets industry\n Collaborating with others to deliver complex projects which may involve multiple systems\n Continuously thinking about the next steps while improving yourself and others around you\n Developing solutions to complex technical challenges while coding, testing, troubleshooting, debugging, and documenting the systems you develop\n Recommending technologies and tools that improve the efficiency and quality of OCC’s systems and development processes\n Optimizing application performance through analysis, code refactoring, and system tuning\n\n\n Supervisory Responsibilities\n \n\n None\n\n\n Are the essential duties of this job required to be performed in an OCC office location?No\n \n\n Qualifications & Experience\n \n\n [Required] 10+ year of experience in building high speed, data-centric solutions\n [Required] Java 10+ years experience\n [Required] Experience with high speed distributed computing frameworks like FLINK, Apache Spark, Kafka Streams, etc\n [Required] Experience with distributed message brokers Kafka, RabbitMQ, ActiveMQ, Amazon Kinesis, etc. Kafka\n [Required] Experience with cloud technologies and migrations. Experience preferred with AWS foundational services like VPCs, Security groups, EC2, RDS, S3 ACLs, KMS, AWS CLI and IAM etc\n [Required] Experience developing and delivering technical solutions using public cloud service providers like Amazon, Google\n [Required] Experience writing unit and integration tests with testing frameworks like Junit, Citrus\n [Required] Experience working with various types of databases like Relational, NoSQL, Object-based, Graph\n [Required] Experience following Git workflows\n [Required] Working knowledge of DevOps tools. Eg Terraform, Ansible, Jenkins, Kubernetes, Helm and CI\/CD pipeline etc\n [Required] Familiarity with monitoring related tools and frameworks like Splunk, ElasticSearch, Prometheus, AppDynamics\n\n\n Technical Skills & Background\n \n\n [Required] Java-based software development experience\n [Required] Experience with Flink, Kafka, and Kubernetes\n [Required] Fluent in object-oriented design, industry best practices, software patterns, and architecture principles\n [Required] Experience with continuous integration tools and techniques, automating processes, and writing scripts using Python and other languages\n [Required] Deep understanding of performance issues and multi-threaded development\n [Required] Proficient in the following types of testing: unit, integration, system, functional, non-functional, regression, performance, security, and acceptance\n [Required] Experience working with five or more of the following: web\/mobile application development, Unix\/Linux environments, event-driven systems, transaction processing systems, distributed and parallel systems, large software system development, security software development, public-cloud platforms\n [Required] Experience with continuous integration tools and techniques, automating processes, and writing scripts using Python and other languages\n\n\n Certifications\n \n\n [Preferred] OCP Java SE 8 Programmer Certification\n [Preferred] AWS Certified Solutions Architect – Associate Level\n\n\n Education & Training\n \n\n [Required] BS degree in Computer Science, similar technical field required\n [Preferred] MS in Computer Science\n\n\n\n\n\n\n\n       Who We Are\n       The Options Clearing Corporation (OCC) is the world's largest equity derivatives clearing organization. Founded in 1973, OCC is dedicated to promoting stability and market integrity by delivering clearing and settlement services for options, futures and securities lending transactions. As a Systemically Important Financial Market Utility (SIFMU), OCC operates under the jurisdiction of the U.S. Securities and Exchange Commission (SEC), the U.S. Commodity Futures Trading Commission (CFTC), and the Board of Governors of the Federal Reserve System. OCC has more than 100 clearing members and provides central counterparty (CCP) clearing and settlement services to 19 exchanges and trading platforms. More information about OCC is available at www.theocc.com.\n     \n\n\n       What We Offer\n       A highly collaborative and supportive environment developed to encourage work-life balance and employee wellness. Some of these components include:\n       A hybrid work environment, up to 2 days per week of remote work\n       Tuition Reimbursement to support your continued education\n       Student Loan Repayment Assistance\n       Technology Stipend allowing you to use the device of your choice to connect to our network while working remotely\n       Generous PTO and Parental leave\n       Competitive health benefits including medical, dental and vision\n     \n\n\n\n\n\n\n   Step 1\n   When you find a position you're interested in, click the 'Apply' button. Please complete the application and attach your resume.\n \n\n\n   Step 2\n   You will receive an email notification to confirm that we've received your application.\n \n\n\n   Step 3\n   If you are called in for an interview, a representative from OCC will contact you to set up a date, time, and location.\n \n\n\n   For more information about \n  \n   OCC\n  , please click \n  \n   here\n  .\n \n\n\n   OCC is an Equal Opportunity Employer\n \nHealth insurance","7":"\n\n*Position is eligible for Remote\/Work from Home Opportunity*\nDepartment: Advanced Automation Telecommuting: Yes Paygrade: E12\nJob Title\n Software Developer I\n Job Summary\n The Software Developer I codes, tests, debugs, documents, and maintains programs utilizing programming languages and an understanding of how data is related across multiple databases, tables, and platforms. This position communicates and collaborates with other Information Technology (IT) staff on application programming.\n Essential Functions\n (Key Duties\/Responsibilities\/Accountabilities)\n\nMakes basic modifications to application programs from detailed specifications.\nCodes programming logic for new or existing solutions software or applications in accordance to design specifications put in place by senior software development staff and leadership.\nTackles specific tasks, smaller pieces, or routine tasks which may be associated with a larger-scale IT solution delivery projects.\nModifies or expands coding to eliminate errors or malfunctions which impact the production of usability of the technology solution.\nLearns and applies internal controls and Systems Development Life Cycle (SDLC) concepts as well as organizational IT standards within their individual contribution on any assigned work.\nHandles installation, configuration, development, workflow design, monitoring, and\/or upgrade of assigned software products under supervision.\nPerforms unit testing of solutions created. Debugs and resolves issues related to unit testing. Documents test results appropriately and ensures issues are resolved prior to the release of the project.\nAnalyzes and troubleshoots basic production application issues to resolution with guidance from senior staff members.\nEnsures complex issues are escalated to more senior staff members in a timely manner. Works under general supervision.\n\nNon-Essential Duties and Functions\n\nOther duties as assigned.\n\nMinimum Qualifications\n\n1 year of IT, programming, software development, help desk, or related experience OR Associate's degree in Computer Science, Information Technology or related field\nBasic level technical\/professional level knowledge and skills\nBasic level collaboration, problem solving\/resolution, prioritization\/organization, and communication skills\nAbility to apply basic knowledge of programming languages and possesses an understanding of how data is related across multiple databases, tables, and platforms\nAble to communicate to others when working on application programming\n\nPreferred Qualifications\n\n4-year degree in Computer Science, Information Technology or related field\n2 years of applicable experience with robotic process automation\n\nEnvironment and Cognitive\/Physical Demands\n\nOffice environment\nAbility to read, hear, speak, keyboard, reason, communicate effectively and problem solve\nRequires prolonged sitting and telephone usage\nRequires the use of office equipment such as computer terminals, telephones, copiers and printers\nInfrequent lifting to 15 pounds\nInfrequent stooping\n\nSegregation of Duties\n Every employee is responsible to perform their duties and responsibilities in accordance with Noridian values, policies and procedures, including but not limited to, Segregation of Duties Principles, HIPAA, Security and Privacy, CMS requirements, the Noridian Compliance Program, and any other applicable laws, rules and regulations.\n Statement of Other Duties\n This document describes the essential functions, requirements, and responsibilities of this job, and is not intended to be a complete list of all tasks and functions. Employees may be requested to perform job related tasks other than those specifically listed in this description and may be required to perform any task requested by the supervisor or management.\n Total Rewards Package:\n Health, Dental and Vision Insurance, Voluntary Insurance Plans, Health Savings and Flexible Spending Accounts, 401k and Company Match, Company-paid Life Insurance, Education Assistance Program, Paid Sick Leave, Paid Holidays, Increasing PTO Accrual Plan, Medical\/Parental\/Disability Leave, Workers Compensation, Retiree Benefits, Severance Package, Employee Assistance Program, Financial and Health Wellness Benefits, Casual Dress, Open Office Setting, and Online Learning System.\n CMS Access Compliance and Regulation Contingency Statement\n Some positions require compliance with (i) federal, and agency specific regulations and related clauses included in Noridian prime contracts with the Government, (ii) background checks, and (iii) eligibility for a government-issued identification card.\n Equal Employment Opportunity\n Equal Opportunity Employer of Minorities, Females, Protected Veterans, and Individuals with Disabilities as well as Sexual Orientation or Gender Identity.\n Other Information\n Noridian is a Federal Contractor required to comply with the Executive Order 14042 and the guidance released by the Safer Federal Workforce Task Force. This Order requires us to ensure all employees working on covered contracts are vaccinated against COVID-19 unless approved for an accommodation due to a medical condition or a sincerely held religious belief. All candidates must be fully vaccinated upon their start date or have an approved accommodation. To request an accommodation, please contact our Human Resources department at noridianhr@noridian.com.\n As of December 7, 2021, the nationwide Federal Mandate has been put on hold. At this time, candidates would not be required to be vaccinated or have an approved accommodation, however if the Executive Order 14042 \/ Federal Mandate is deemed Legal by court rulings, candidates and employees would need to comply.\n Below is the salary range for potential new hires:\n Salary Range: $59,937.84 - $98,582.59\n Other Compensation: Incentive Plan\n\n\n Notice of Collection & Privacy Policy for Applicants Residing in California: California Applicant Privacy Policy | Noridian (noridiansolutions.com)\n This job will be closed 02\/27\/2023 at 8:00AM CST. No further applications will be considered.\n\n Equal Opportunity Employer\/Protected Veterans\/Individuals with Disabilities\n The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\nHealth insurance","8":"At Discord, we believe everyone can find a place where they belong. Our team’s mission is to help make it easy for everyone to find and join meaningful conversations and to make every part of our product feel smart and delightful. We are looking for a strong technical leader to help build our Personalization team out and work across Product Engineering, Machine Learning Engineering, Design, Data Science, Infrastructure, and other organizations to achieve those goals. Come help make it easy for everyone to find the special moments that matter to them on Discord. What you'll be doing Collaborate with engineers across our product and ML squads to build and iterate on new personalization products Partner with our ML Engineering and Platform teams to shape the future of ML products at Discord Take on critical technical challenges as we start to scale out our ML products Own major, complex initiatives that are essential to both our team’s and Discord’s success Develop deep expertise on both our tech stack and user behaviors to help set strategy and priorities for the team Work with other staff engineers across Discord to maintain a high technical bar for all our systems and products Coach and mentor engineers across our teams to help them level up and grow into the challenges we’re taking on What you should have Full-stack experience. Our team need expertise on everything from user-facing features, our core infrastructure, and how we work with ML infrastructure to deliver on our goals. Technical leadership. We need someone who can step up and guide the technical direction of the team working in a space that is technically challenging and complicated across ML, Product, and Infrastructure. This means developing deep expertise as well as leveling up other engineers on the team. A builder’s mindset. This team is in its early days and has the opportunity to shape the direction of our products and infrastructure however we need to in order to succeed. Deep curiosity. Asking how things work and digging in is essential to understanding how we can personalize Discord for users, especially at scale. User empathy. At the end of the day, we can only be successful by making sure we are building products that bring joy and value to our users. Comfort in chaos. A lot of our work is exploratory and requires being comfortable working with new systems or having minimal prior work to build on top of. Ruthless prioritization. We have a lot of opportunities ahead of us, but we need engineers who can help make hard decisions both on what we should and shouldn’t do. New York City residents only: Minimum salary of $214,000\/year + equity and benefits*Note: Disclosure as required by NYC Pay Transparency Law.Colorado residents only: Minimum salary of $171,200\/year + equity and benefits*Note: Disclosure as required by sb19-085(8-5-20). #LI-HYBRID Benefits and Perks Comprehensive medical insurance including Health, Dental and Vision (plus up to $20,000 for gender affirmation procedures) Mental health resources and quarterly wellness stipends 16+ paid holidays, 4 weeks of PTO + use-what-you-need sick days Paid parental leave (plus fertility, adoption and other family planning benefits) Flexible long-term work options (remote and hybrid) Volunteer time off A diverse slate of Employee Resource Groups Plus commuter contributions and other perks for office-based employees About Us Discord is a voice, video and text app that helps friends and communities come together to hang out and explore their interests — from artists and activists, to study groups, sneakerheads, plant parents, and more. With 150 million monthly users across 19 million active communities, called servers, Discord has grown to become one of the most popular communications services in the world. Discord was built without selling ads or user data and instead, offers a premium subscription called Nitro that gives users special perks like higher quality streams and fun customizations. We’re working toward an inclusive world where no one feels like an outsider, where genuine human connection is a click, text chat, or voice call away. A place where everyone can find belonging. Challenging? Heck yes. Rewarding? Double heck yes. It’s a mission that gives us the chance to positively impact millions of people all over the world. So if this strikes a chord with you, come build belonging with us!Health insurance","9":"\n Locations: US Remote, United States of America\n  Senior Software Engineer\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Do you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n What You’ll Do:\n\n Collaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\n Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\n Collaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n Utilize programming languages like JavaScript, Java, HTML\/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\n\n Basic Qualifications:\n\n Bachelor’s Degree\n At least 4 years of experience in software engineering (Internship experience does not apply)\n\n\n Preferred Qualifications:\n\n 5+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n 1+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n 3+ years of experience in open source frameworks\n 2+ years of experience in Agile practices\n\n\n At this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n The minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n Location is New York City: $156,596 - $184,748 for Senior Software Engineer\n  Location is San Francisco, California: $165,896 - $195,720 for Senior Software Engineer\n  Remote roles in other areas of New York & California, and across Colorado & Washington: $132,699 - $156,555 for Senior Software Engineer\n \n Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n \n\n\n\n\n Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\n\n\n\n No agencies please. Capital One is an Equal Opportunity Employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex, race, color, age, national origin, religion, physical and mental disability, genetic information, marital status, sexual orientation, gender identity\/assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status prohibited by applicable national, federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n \n If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n For technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n Capital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\n Capital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\nHealth insurance","10":"\n\nCostco IT is responsible for the technical future of Costco Wholesale, the third largest retailer in the world with wholesale operations in fourteen countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco ranks seventh in Forbes “World’s Best Employers”.\n This is an environment unlike anything in the high-tech world and the secret of Costco’s success is its culture. The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes. Our employees and our members come FIRST. Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others. \nCome join Costco Digital - part of the Costco Wholesale IT family. Costco Digital is a dynamic, fast-paced environment, working through exciting transformation efforts. We are building the next generation digital retail environment where you will be surrounded by dedicated and highly professional employees. We are embarking on a large digital transformation and need team members like you to help us grow to the next level.\n Our Digital team is transforming how we deliver solutions and interact with our members across our Mobile, Commerce and Order Management platforms. We have a culture of improvement & learning with a start up mentality and a customer centric approach for our Costco members and our employees. We are looking for talented individuals to join our team and pursue bold ideas and explore growth opportunities. \nWe are looking for talented individuals to join our team in 2023. As a graduate, you will get opportunities to kickstart your career, pursue bold ideas and explore growth opportunities.\n\nResponsibilities:\n This role provides candidates with the opportunity to join one of our engineering teams where you will have the opportunity to:\n\nDevelop efficient, highly scalable and secured services to build\/integrate Commerce, Mobile and Order Management solutions \nOptimize backend systems and services for security, modularity, efficiency and scalability. \nDevelop best-in-class front end experiences utilizing React. \nDevelop Mobile applications on iOS and Android. We encourage all of our mobile developers to be open to exploring both platforms. This role is ideal for developers who feel confident in their technical ability and want to be a part of a highly-skilled and constantly improving engineering team. \n\nQualifications: \n\nBachelor's or Master's degree in Computer Science or related technical discipline. \nFinal year or recent graduate with a background in Software Development, Computer Science, Computer Engineering, or a related technical discipline. \nExperience with coding in Java, C# or JavaScript, Swift, Kotlin. \nAwareness of common coding frameworks like Flutter. \nSoftware programming capabilities that exhibit good code design and coding style. \nGeneral understanding of data structures, networking, data security and highly scalable systems design. \nGeneral knowledge of common databases and messaging frameworks like Cosmos, MySQL, Redis, Kafka.  \n\n\nPreferred Qualifications:\n\nDemonstrated software engineering experience from previous internship, work experience, coding competitions, or publications. \nHigh levels of creativity and quick problem-solving capabilities. \n\nRequired Documents \n Cover Letter\n Resume \n\nCalifornia applicants, please click here to review the Costco Applicant Privacy Notice.\n\n \nPay Range: $85,000 - $110,000\n We offer a comprehensive package of benefits including paid time off, health benefits — medical\/dental\/vision\/hearing aid\/pharmacy\/behavioral health\/employee assistance, health care reimbursement account, dependent care assistance plan, commuter benefits, short-term disability and long-term disability insurance, AD&D insurance, life insurance, 401(k), stock purchase plan, SmartDollar financial wellness program, to eligible employees.\n Costco is committed to a diverse and inclusive workplace. Costco is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or any other legally protected status. If you need assistance and\/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to IT-Recruiting@costco.com\n If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas.\n\n\nHealth insurance","11":"\nOnyx Aerospace in Huntsville, AL is looking to hire a full-time Software Engineer I to apply leading-edge gaming technology to the department of defense. Are you interested in learning about gaming engine technology? Do you want to choose your schedule and have a better work\/life balance? Would you like to join a company that offers remote work and a welcoming culture? If so, please read on!\n This software engineering position earns a competitive salary of $70,000 - $80,000 per year, depending on experience. We provide generous benefits, including paid time off (PTO), 10 paid holidays, 85% paid health insurance, dental, vision, 100% paid life insurance, long- and short-term disability, company lunches, a Christmas party, stocked break room, and flexible schedules. If this sounds like the right remote work opportunity for you, apply today!\n\n WHO WE ARE\n We are a HubZone certified contractor providing commercial and government support services and specializing in analytical and aerospace (Defense & Space) services. Our team demonstrates missile, launch, and space system expertise. We combine the knowledge and capability of a large company with the flexibility, spirit, and heart of a small business to serve our clients best. And, we are proud of our commitment to rebuilding our local, disadvantaged communities.\n We know that we could not serve our clients without our innovative, skilled, and enthusiastic team. That is why we're dedicated to providing a fun-loving and relaxed work atmosphere where we all can thrive. Nobody needs a manager breathing down their neck! At Onyx, we truly trust our employees, rally around them, and allow them the flexibility to work from home. But just because you may work remotely doesn't mean you're on your own. We have established many opportunities for team members to connect and build relationships as well as for team leads to offer individual support. When you join us, you become part of our work family!\n\n WHAT YOU DO\n As a Software Engineer I, you get to work independently and with your team to aid in the design and development of software applications. Your work keeps you involved in all stages of the application development life cycle as you perform coding, debugging, testing, and troubleshooting. You love the opportunity to expand your skills by contributing moderately to complex aspects of various projects. At the end of the day, you feel accomplished as you complete projects and further develop your gaming and simulation skills for real-world applications!\n\n QUALIFICATIONS FOR A SOFTWARE ENGINEER I\n\n Bachelor's degree OR currently finishing a Bachelor's degree in software engineering, gaming, electrical engineering, mathematics, or a related discipline\n Ability to obtain and maintain a SECRET clearance\n Familiarity with the Agile process\n Experience developing code with a team of engineers of various disciplines\n Software engineering experience\n Interest in gaming and simulation\n\n Experience with game engines is preferred but not required. Don't have experience? Don't worry! As long as you have an interest in gaming simulation, we will train you.\n Are you self-motivated and able to work under minimal supervision? Do you work well in a collaborative environment? Are you eager to learn and grow your career? If yes, you might just be perfect for this position!\n\n WORK SCHEDULE FOR A SOFTWARE ENGINEER I\n This full-time position works a highly flexible schedule. As long as you can meet deadlines and attend our twice-weekly virtual \"tag-ups\" (meetings), you choose your hours! This position can be fully remote with the possibility of 5-10% travel to Huntsville or can be fully in-office.\n\n ARE YOU READY TO JOIN OUR TEAM?\n If you feel that you would be right for this remote gaming technology job, please fill out our initial 3-minute, mobile-friendly application. We look forward to meeting you!\n\n Location: 35805, 37128\nHealth insurance","12":"\n Locations: VA - McLean, United States of America, McLean, Virginia\n  Senior Software Engineer, Full Stack (Remote - Eligible)\n \n Do you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n\n Capital One is open to hiring a Remote Employee for this opportunity.\n\n What You’ll Do:\n\n Collaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\n Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\n Collaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n Utilize programming languages like JavaScript, Java, HTML\/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\n\n\n Basic Qualifications:\n\n Bachelor’s Degree\n At least 4 years of experience in software engineering (Internship experience does not apply)\n\n\n Preferred Qualifications:\n\n 5+ years of experience in at least one of the following: Angular, React or VueJS.\n 1+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n 3+ years of experience in open source frameworks\n 2+ years of experience in Agile practices\n\n\n At this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\n The minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n Location is New York City: $156,596 - $184,748 for Senior Software Engineer\n  Location is San Francisco, California: $165,896 - $195,720 for Senior Software Engineer\n  Remote roles in other areas of New York & California, and across Colorado & Washington: $132,699 - $156,555 for Senior Software Engineer\n \n Candidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n This role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and\/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n \n\n\n\n\n Capital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\n\n\n\n No agencies please. Capital One is an Equal Opportunity Employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex, race, color, age, national origin, religion, physical and mental disability, genetic information, marital status, sexual orientation, gender identity\/assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status prohibited by applicable national, federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n \n If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\n For technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\n Capital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\n Capital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\nHealth insurance","13":"\n\n  It's fun to work in a company where people truly BELIEVE in what they're doing!\n \n\n We're committed to bringing passion and customer focus to the business.\n\n\n\n   We are looking for someone who loves writing software and is passionate about crafting great code. Specifically, we are looking for a .NET framework developer who is fluent in C# and can bring that experience to help our team grow our application suite. The ideal candidate will have experience with both ASP.NET MVC and Restful API development. There may be additional opportunities to work with our front-end team using React.js and JavaScript.\n \n\n\n   Primary Responsibilities:\n \n\n Working on our established .NET framework application to expand functionality and stability.\n Extend our current API backend to support our next generation of application capabilities.\n Extend our current integrations to additional third-party partners.\n Assist with performance tuning our backend to maximize our performance.\n\n\n\n   Primary Qualifications:\n \n\n At least 2 years of .NET web development experience.\n Highly self-motivated and driven. We work 100% remote and expect our team to manage their day-to-day workload.\n A passionate learner. You enjoy learning new frameworks or languages just to see how it will enhance your skills.\n Excellent communication skills. You will work closely with the rest of our development team, our support team, and our user base.\n An ambitious mover-and-shaker. We are crafting the next generation of inventory software and there are lots of opportunities to innovate. We want someone who dares to be great.\n\n\n\n   Success factors\/job competencies:\n \n\n\n Action Oriented & Drive for Results: Enjoys working hard; is action oriented and full of energy for the things seen as challenging; not fearful of action with minimum of planning; seizes opportunity to drive business objectives forward. Can be counted on to meet or exceed goals successfully; is consistent in performance and strives to be a top performer; very bottom line oriented; steadfastly pushes self and other for results. Uses rigorous logic and methods to solve difficult problems with effective solutions; probes all fruitful sources for answers; can see hidden problems; is excellent at honest analysis; looks beyond the obvious and doesn’t stop at the first answers.\n\n\n\n Critical Thinking & Continuous Development: Can effectively cope with change; can shift gears comfortably; ability to synthesize objectives across the organization and take appropriate action without having the total picture; isn’t upset when things are up in the air; can comfortably handle risk and uncertainty. Learns quickly when facing new problems; a relentless and versatile learner; open to change; analyzes both successes and failures for clues to improvement; experiments and will try anything to find solutions; enjoys the challenge of unfamiliar tasks; quickly grasps the essence and the underlying structure of anything. Deals with concepts and complexity comfortably; capable, and agile. Applies new learnings to enhance productivity and quality of the work without prompting. Seeks and applies efficiencies in day-to-day work, constantly improving and streamlining processes to achieve company objectives.\n\n\n\n Communication & Relationship Building: Has the ability to perceive reactions via non-verbal signals of others, reason with others to promote thinking and cognitive activity, understand drivers of decisions by interpreting the cause of other’s reactions and what it may mean, and manage relationships by working collaboratively to reach the best outcome for the company. Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect. Actively and consistently seeks to work cooperatively with others, inside and outside the organization, to accomplish objectives to build and maintain mutually beneficial partnerships, leverage information, and achieve results. Serves as a collaboration catalyst that motivates others to want to collaborate as well.\n\n\n\n   Benefit Information:\n \n\n   Fullsteam and its Family of Companies offers a competitive wage as well the following benefits:\n \n\n Major Medical\n Dental\n Vision\n 401k with Company Match\n Paid Holidays\n Personal Time Off\n Employer Paid Short Term Disability & AD&D\n Other employee paid supplemental insurances offered\n\n\n\n   Physical demands and work environment:\n \n\n\n   Physical demands: While performing the duties of this job, the employee is occasionally required to walk; sit; use hands to finger, handle, or feel objects, tools, or controls; reach with hands and arms; balance; stoop; talk or hear. Employee must occasionally lift and\/or move up to 15 pounds.\n \n\n\n   This position is 100% remote. The candidate would need to have a suitable work environment set up as their home office and be comfortable managing their own schedule in a non-corporate office environment\n \n\n\n   EEOC & ADA Statement:\n \n\n\n   Fullsteam and its family of companies provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.\n \n\n   Fullsteam and its family of companies complies with federal and state disability laws and makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and\/or to receive other benefits and privileges of employment, please contact Fullsteam Human Resources.\n \n\n   This applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\n \n\n\n   Final candidate must be able to pass a background check.\n \nHealth insurance","14":"\nThe Challenge:\n Do you want to build software that solves enterprise-scale challenges while learning and growing your skills?\n\n This role is more than just coding. Our junior developers use their passion to learn new tools and techniques and apply them towards identifying and delivering needed software solutions. You will learn software development principles and how to apply them through various development methodologies, including Scrum, Scaled Agile Framework, and Kanban. Our goal in hiring a junior developer is to match your intensity and passion for software development with our deep experience in the practice of software delivery to help deliver products for our customers and to evolve your career. This position is open to remote delivery anywhere within the U.S., to include the District of Columbia.\n\n Join us. The world can’t wait.\n\n You Have:\n\n Experience with Java, Python, and JavaScript in industry or academic environments\n Experience with researching, designing, developing, or modifying enterprise-wide systems or applications software in an internship or academic environment\n Knowledge of Web protocols and services\n Ability to work independently and within a team\n Ability to obtain a security clearance\n HS diploma or GED\n\n\n Nice If You Have:\n\n Experience with Agile software development processes and tools, including Atlassian Tool Suite\n Experience with documenting testing and maintenance of system corrections\n Knowledge of Oracle or MS Structured Query Language\n Possession of excellent analysis and problem solving skills\n Bachelor's degree\n\n\n Clearance:\n Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n\n Build Your Career:\n A challenging and dynamic work environment isn’t all we have to offer. When you join Booz Allen, you’ll have access to:\n\n experts in virtually every field\n a culture that focuses on supporting our employees\n opportunities that provide stability while offering variety\n\n\n You’ll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want as you chart your own course for success.\n\n Compensation\n At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n Salary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $49,900.00 to $102,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees.\n \n EEO Commitment\n We’re an equal employment opportunity\/affirmative action employer that empowers our people to fearlessly drive change – no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.\n\nHealth insurance"}}